Revit.Elements.DirectShapeState
This class acts as a representation of a directShape state, we can store it in trace
and on protogeometry types (in their tags dictionary) to keep track of the state of
a DirectShape wrapper type, it inherits from SerializeableId so that ElementLifeCycle
and DocumentEvents continue to function for DirectShapes.